#+begin_src conf :tangle ./git_add.txt
  configs/_base_/datasets/fashion.py
  configs/_base_/schedules/schedule_160k.py
  configs/_base_/schedules/schedule_320k.py
  configs/_base_/schedules/schedule_640k.py
  configs/_base_/schedules/schedule_80k.py
  configs/segnext/segnext_mscan-b_1x16_512x512_adamw_160k_ade20k.py
  configs/segnext/segnext_mscan-l_1x16_512x512_adamw_160k_ade20k.py
  configs/segnext/segnext_mscan-s_1x16_512x512_adamw_160k_ade20k.py
  configs/segnext/segnext_mscan-t_1x16_512x512_adamw_160k_ade20k.py
  git_add.txt
  git.org
  git_rm.txt
  git_update.sh
  main.org
#+end_src

#+begin_src conf :tangle ./git_rm.txt
  #git.org#
  .#git.org
  git.org~
  .git.org.~undo-tree~
  main.org~
  .main.org.~undo-tree~
  configs/segnext/.segnext_mscan-t_1x16_512x512_adamw_160k_ade20k.py.~undo-tree~
#+end_src

#+begin_src sh :results output :shebang #!/bin/sh :tangle ./git_update.sh
  cd "$('dirname' '--' "${0}")"
  (sed 's@^@(git add "@g;s@$@");@g' './git_add.txt'; sed 's@^@(rm -vf -- "@g;s@$@");@g' './git_rm.txt') | sort | uniq | sh
#+end_src

#+RESULTS:

#+begin_src sh :shebang #!/bin/sh :results output
  ./git_update.sh
  git status
#+end_src

#+RESULTS:
#+begin_example
removed '.git.org.~undo-tree~'
On branch master
Your branch is up to date with 'origin/master'.

Changes to be committed:
  (use "git restore --staged <file>..." to unstage)
	modified:   configs/segnext/segnext_mscan-t_1x16_512x512_adamw_160k_ade20k.py
	modified:   git.org
	modified:   main.org

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	

#+end_example

#+begin_src sh :results output :shebang #!/bin/sh
git commit -m 'Added changes for training on fashion datasets and other simple finetuning'
#+end_src

#+RESULTS:
: [master 8454c91] Added changes for training on fashion datasets and other simple finetuning
:  5 files changed, 326 insertions(+)
:  create mode 100644 git.org
:  create mode 100644 git_add.txt
:  create mode 100644 git_rm.txt
:  create mode 100755 git_update.sh
:  create mode 100644 main.org


#+begin_src sh :results output :shebang #!/bin/sh
git push
#+end_src

#+RESULTS:
